tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_lpuart.h
  __IO uint32_t                TxXferCount;              /*!< LPUART Tx Transfer Counter           */

  uint8_t                      *pRxBuffPtr;              /*!< Pointer to LPUART Rx transfer Buffer */

  uint32_t                     RxXferSize;               /*!< LPUART Rx Transfer size              */

  __IO uint32_t                RxXferCount;              /*!< LPUART Rx Transfer Counter           */

  uint16_t                     Mask;                     /*!< LPUART Rx RDR register mask          */

  uint32_t                     NbRxDataToProcess;        /*!< Number of data to process during RX ISR execution */

  uint32_t                     NbTxDataToProcess;        /*!< Number of data to process during TX ISR execution */

  void (*RxISR)(struct __LPUART_HandleTypeDef *hlpuart); /*!< Function pointer on Rx IRQ handler */

  void (*TxISR)(struct __LPUART_HandleTypeDef *hlpuart); /*!< Function pointer on Tx IRQ handler */

  DMA_HandleTypeDef            *hdmatx;                  /*!< LPUART Tx DMA Handle parameters      */

  DMA_HandleTypeDef            *hdmarx;                  /*!< LPUART Rx DMA Handle parameters      */

  HAL_LockTypeDef              Lock;                     /*!< Locking object                     */

  __IO HAL_LPUART_StateTypeDef gState;                   /*!< LPUART state information related to global Handle management
                                                              and also related to Tx operations. This parameter
                                                              can be a value of @ref HAL_LPUART_StateTypeDef */

  __IO HAL_LPUART_StateTypeDef RxState;                  /*!< LPUART state information related to Rx operations. This
                                                              parameter can be a value of @ref HAL_LPUART_StateTypeDef */

  __IO uint32_t                ErrorCode;                /*!< LPUART Error code                    */

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  void (* TxBlockCpltCallback)(struct __LPUART_HandleTypeDef *hlpuart);       /*!< LPUART Tx Block Complete Callback       */
  void (* TxHalfBlockCpltCallback)(struct __LPUART_HandleTypeDef *hlpuart);   /*!< LPUART Tx Half Block Complete Callback  */
  void (* TxCpltCallback)(struct __LPUART_HandleTypeDef *hlpuart);            /*!< LPUART Tx Complete Callback             */
  void (* RxBlockCpltCallback)(struct __LPUART_HandleTypeDef *hlpuart);       /*!< LPUART Rx Block Complete Callback       */
  void (* RxHalfBlockCpltCallback)(struct __LPUART_HandleTypeDef *hlpuart);   /*!< LPUART Rx Half Block Complete Callback  */
  void (* RxCpltCallback)(struct __LPUART_HandleTypeDef *hlpuart);            /*!< LPUART Rx Complete Callback             */
  void (* ErrorCallback)(struct __LPUART_HandleTypeDef *hlpuart);             /*!< LPUART Error Callback                   */
  void (* AbortCpltCallback)(struct __LPUART_HandleTypeDef *hlpuart);         /*!< LPUART Abort Complete Callback          */
  void (* AbortTransmitCpltCallback)(struct __LPUART_HandleTypeDef *hlpuart); /*!< LPUART Abort Transmit Complete Callback */
  void (* AbortReceiveCpltCallback)(struct __LPUART_HandleTypeDef *hlpuart);  /*!< LPUART Abort Receive Complete Callback  */
  void (* WakeupCallback)(struct __LPUART_HandleTypeDef *hlpuart);            /*!< LPUART Wakeup Callback                  */

  void (* MspInitCallback)(struct __LPUART_HandleTypeDef *hlpuart);           /*!< LPUART Msp Init callback                */
  void (* MspDeInitCallback)(struct __LPUART_HandleTypeDef *hlpuart);         /*!< LPUART Msp DeInit callback              */
#endif  /* USE_HAL_LPUART_REGISTER_CALLBACKS */

} LPUART_HandleTypeDef;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL LPUART Callback ID enumeration definition
  */
typedef enum
{
  HAL_LPUART_TX_BLOCKCOMPLETE_CB_ID        = 0x00U,    /*!< LPUART Tx Block Complete Callback ID       */
  HAL_LPUART_TX_HALFBLOCKCOMPLETE_CB_ID    = 0x01U,    /*!< LPUART Tx Half Block Complete Callback ID  */
  HAL_LPUART_TX_COMPLETE_CB_ID             = 0x02U,    /*!< LPUART Tx Complete Callback ID             */
  HAL_LPUART_RX_BLOCKCOMPLETE_CB_ID        = 0x03U,    /*!< LPUART Rx Block Complete Callback ID       */
  HAL_LPUART_RX_HALFBLOCKCOMPLETE_CB_ID    = 0x04U,    /*!< LPUART Rx Half Block Complete Callback ID  */
  HAL_LPUART_RX_COMPLETE_CB_ID             = 0x05U,    /*!< LPUART Rx Complete Callback ID             */
  HAL_LPUART_ERROR_CB_ID                   = 0x06U,    /*!< LPUART Error Callback ID                   */
  HAL_LPUART_ABORT_COMPLETE_CB_ID          = 0x07U,    /*!< LPUART Abort Complete Callback ID          */
  HAL_LPUART_ABORT_TRANSMIT_COMPLETE_CB_ID = 0x08U,    /*!< LPUART Abort Transmit Complete Callback ID */
  HAL_LPUART_ABORT_RECEIVE_COMPLETE_CB_ID  = 0x09U,    /*!< LPUART Abort Receive Complete Callback ID  */
  HAL_LPUART_WAKEUP_CB_ID                  = 0x0AU,    /*!< LPUART Wakeup Callback ID                  */

  HAL_LPUART_MSPINIT_CB_ID                 = 0x0BU,    /*!< LPUART MspInit callback ID                 */
  HAL_LPUART_MSPDEINIT_CB_ID               = 0x0CU     /*!< LPUART MspDeInit callback ID               */

} HAL_LPUART_CallbackIDTypeDef;

/**
  * @brief  HAL LPUART Callback pointer definition
  */
typedef  void (*pLPUART_CallbackTypeDef)(LPUART_HandleTypeDef *hlpuart);  /*!< pointer to an LPUART callback function */

#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup LPUART_Exported_Constants LPUART Exported Constants
  * @{
  */

/** @defgroup LPUART_State_Definition LPUART State Code Definition
  * @{
  */
#define  HAL_LPUART_STATE_RESET         0x00000000U    /*!< Peripheral is not initialized
                                                            Value is allowed for gState and RxState */
#define  HAL_LPUART_STATE_READY         0x00000020U    /*!< Peripheral Initialized and ready for use
                                                            Value is allowed for gState and RxState */
#define  HAL_LPUART_STATE_BUSY          0x00000024U    /*!< an internal process is ongoing
                                                            Value is allowed for gState only */
#define  HAL_LPUART_STATE_BUSY_TX       0x00000021U    /*!< Data Transmission process is ongoing
                                                            Value is allowed for gState only */
#define  HAL_LPUART_STATE_BUSY_RX       0x00000022U    /*!< Data Reception process is ongoing
                                                            Value is allowed for RxState only */
#define  HAL_LPUART_STATE_BUSY_TX_RX    0x00000023U    /*!< Data Transmission and Reception process is ongoing
                                                            Not to be used for neither gState nor RxState.Value is result
                                                            of combination (Or) between gState and RxState values */
#define  HAL_LPUART_STATE_TIMEOUT       0x000000A0U    /*!< Timeout state
                                                            Value is allowed for gState only */
#define  HAL_LPUART_STATE_ERROR         0x000000E0U    /*!< Error
                                                            Value is allowed for gState only */
/**
  * @}
  */

/** @defgroup LPUART_Error_Definition   LPUART Error Definition
  * @{
  */
#define  HAL_LPUART_ERROR_NONE             ((uint32_t)0x00000000U)    /*!< No error                */
#define  HAL_LPUART_ERROR_PE               ((uint32_t)0x00000001U)    /*!< Parity error            */
#define  HAL_LPUART_ERROR_NE               ((uint32_t)0x00000002U)    /*!< Noise error             */
#define  HAL_LPUART_ERROR_FE               ((uint32_t)0x00000004U)    /*!< Frame error             */
#define  HAL_LPUART_ERROR_ORE              ((uint32_t)0x00000008U)    /*!< Overrun error           */
#define  HAL_LPUART_ERROR_DMA              ((uint32_t)0x00000010U)    /*!< DMA transfer error      */
#define  HAL_LPUART_ERROR_RTO              ((uint32_t)0x00000020U)    /*!< Receiver Timeout error  */

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
#define  HAL_LPUART_ERROR_INVALID_CALLBACK ((uint32_t)0x00000040U)    /*!< Invalid Callback error  */
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
/**
  * @}
  */

