tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_lpuart.h
/** @defgroup LPUART_Stop_Bits   LPUART Number of Stop Bits
  * @{
  */
#define LPUART_STOPBITS_1                     0x00000000U                        /*!< LPUART frame with 1 stop bit    */
#define LPUART_STOPBITS_2                     LPUART_CR2_STOP_1                  /*!< LPUART frame with 2 stop bits   */
/**
  * @}
  */

/** @defgroup LPUART_Parity  LPUART Parity
  * @{
  */
#define LPUART_PARITY_NONE                    0x00000000U                        /*!< No parity   */
#define LPUART_PARITY_EVEN                    LPUART_CR1_PCE                     /*!< Even parity */
#define LPUART_PARITY_ODD                     (LPUART_CR1_PCE | LPUART_CR1_PS)   /*!< Odd parity  */
/**
  * @}
  */

/** @defgroup LPUART_Hardware_Flow_Control LPUART Hardware Flow Control
  * @{
  */
#define LPUART_HWCONTROL_NONE                  0x00000000U                          /*!< No hardware control       */
#define LPUART_HWCONTROL_RTS                   LPUART_CR3_RTSE                      /*!< Request To Send           */
#define LPUART_HWCONTROL_CTS                   LPUART_CR3_CTSE                      /*!< Clear To Send             */
#define LPUART_HWCONTROL_RTS_CTS               (LPUART_CR3_RTSE | LPUART_CR3_CTSE)  /*!< Request and Clear To Send */
/**
  * @}
  */

/** @defgroup LPUART_Mode LPUART Transfer Mode
  * @{
  */
#define LPUART_MODE_RX                        LPUART_CR1_RE                    /*!< RX mode        */
#define LPUART_MODE_TX                        LPUART_CR1_TE                    /*!< TX mode        */
#define LPUART_MODE_TX_RX                     (LPUART_CR1_TE | LPUART_CR1_RE)  /*!< RX and TX mode */
/**
  * @}
  */

/** @defgroup LPUART_State  LPUART State
  * @{
  */
#define LPUART_STATE_DISABLE                  0x00000000U         /*!< LPUART disabled  */
#define LPUART_STATE_ENABLE                   LPUART_CR1_UE       /*!< LPUART enabled   */
/**
  * @}
  */

/** @defgroup LPUART_ClockPrescaler  LPUART Clock Prescaler
  * @{
  */
#define LPUART_PRESCALER_DIV1    0x00000000U  /*!< fclk_pres = fclk     */
#define LPUART_PRESCALER_DIV2    0x00000001U  /*!< fclk_pres = fclk/2   */
#define LPUART_PRESCALER_DIV4    0x00000002U  /*!< fclk_pres = fclk/4   */
#define LPUART_PRESCALER_DIV6    0x00000003U  /*!< fclk_pres = fclk/6   */
#define LPUART_PRESCALER_DIV8    0x00000004U  /*!< fclk_pres = fclk/8   */
#define LPUART_PRESCALER_DIV10   0x00000005U  /*!< fclk_pres = fclk/10  */
#define LPUART_PRESCALER_DIV12   0x00000006U  /*!< fclk_pres = fclk/12  */
#define LPUART_PRESCALER_DIV16   0x00000007U  /*!< fclk_pres = fclk/16  */
#define LPUART_PRESCALER_DIV32   0x00000008U  /*!< fclk_pres = fclk/32  */
#define LPUART_PRESCALER_DIV64   0x00000009U  /*!< fclk_pres = fclk/64  */
#define LPUART_PRESCALER_DIV128  0x0000000AU  /*!< fclk_pres = fclk/128 */
#define LPUART_PRESCALER_DIV256  0x0000000BU  /*!< fclk_pres = fclk/256 */
/**
  * @}
  */

/** @defgroup LPUART_DMA_Tx    LPUART DMA Tx
  * @{
  */
#define LPUART_DMA_TX_DISABLE                 0x00000000U                /*!< LPUART DMA TX disabled */
#define LPUART_DMA_TX_ENABLE                  LPUART_CR3_DMAT            /*!< LPUART DMA TX enabled  */
/**
  * @}
  */

/** @defgroup LPUART_DMA_Rx   LPUART DMA Rx
  * @{
  */
#define LPUART_DMA_RX_DISABLE                 0x00000000U                 /*!< LPUART DMA RX disabled */
#define LPUART_DMA_RX_ENABLE                  LPUART_CR3_DMAR             /*!< LPUART DMA RX enabled  */
/**
  * @}
  */

/** @defgroup LPUART_Half_Duplex_Selection  LPUART Half Duplex Selection
  * @{
  */
#define LPUART_HALF_DUPLEX_DISABLE            0x00000000U                 /*!< LPUART half-duplex disabled */
#define LPUART_HALF_DUPLEX_ENABLE             LPUART_CR3_HDSEL            /*!< LPUART half-duplex enabled  */
/**
  * @}
  */

/** @defgroup LPUART_WakeUp_Methods   LPUART WakeUp Methods
  * @{
  */
#define LPUART_WAKEUPMETHOD_IDLELINE          0x00000000U                 /*!< LPUART wake-up on idle line    */
#define LPUART_WAKEUPMETHOD_ADDRESSMARK       LPUART_CR1_WAKE             /*!< LPUART wake-up on address mark */
/**
  * @}
  */

/** @defgroup LPUART_Request_Parameters LPUART Request Parameters
  * @{
  */
#define LPUART_SENDBREAK_REQUEST              LPUART_RQR_SBKRQ        /*!< Send Break Request          */
#define LPUART_MUTE_MODE_REQUEST              LPUART_RQR_MMRQ         /*!< Mute Mode Request           */
/**
  * @}
  */

/** @defgroup LPUART_Advanced_Features_Initialization_Type  LPUART Advanced Feature Initialization Type
  * @{
  */
#define LPUART_ADVFEATURE_NO_INIT                 0x00000000U          /*!< No advanced feature initialization       */
#define LPUART_ADVFEATURE_TXINVERT_INIT           0x00000001U          /*!< TX pin active level inversion            */
#define LPUART_ADVFEATURE_RXINVERT_INIT           0x00000002U          /*!< RX pin active level inversion            */
#define LPUART_ADVFEATURE_DATAINVERT_INIT         0x00000004U          /*!< Binary data inversion                    */
#define LPUART_ADVFEATURE_SWAP_INIT               0x00000008U          /*!< TX/RX pins swap                          */
#define LPUART_ADVFEATURE_RXOVERRUNDISABLE_INIT   0x00000010U          /*!< RX overrun disable                       */
#define LPUART_ADVFEATURE_DMADISABLEONERROR_INIT  0x00000020U          /*!< DMA disable on Reception Error           */
#define LPUART_ADVFEATURE_MSBFIRST_INIT           0x00000080U          /*!< Most significant bit sent/received first */
/**
  * @}
  */

/** @defgroup LPUART_Tx_Inv LPUART Advanced Feature TX Pin Active Level Inversion
  * @{
  */
#define LPUART_ADVFEATURE_TXINV_DISABLE       0x00000000U             /*!< TX pin active level inversion disable */
#define LPUART_ADVFEATURE_TXINV_ENABLE        LPUART_CR2_TXINV        /*!< TX pin active level inversion enable  */
/**
  * @}
  */

/** @defgroup LPUART_Rx_Inv LPUART Advanced Feature RX Pin Active Level Inversion
  * @{
  */
#define LPUART_ADVFEATURE_RXINV_DISABLE       0x00000000U             /*!< RX pin active level inversion disable */
#define LPUART_ADVFEATURE_RXINV_ENABLE        LPUART_CR2_RXINV        /*!< RX pin active level inversion enable  */
/**
  * @}
  */

/** @defgroup LPUART_Data_Inv  LPUART Advanced Feature Binary Data Inversion
  * @{
  */
#define LPUART_ADVFEATURE_DATAINV_DISABLE     0x00000000U             /*!< Binary data inversion disable */
#define LPUART_ADVFEATURE_DATAINV_ENABLE      LPUART_CR2_DATAINV      /*!< Binary data inversion enable  */
/**
  * @}
  */

/** @defgroup LPUART_Rx_Tx_Swap LPUART Advanced Feature RX TX Pins Swap
  * @{
  */
#define LPUART_ADVFEATURE_SWAP_DISABLE        0x00000000U             /*!< TX/RX pins swap disable */
#define LPUART_ADVFEATURE_SWAP_ENABLE         LPUART_CR2_SWAP         /*!< TX/RX pins swap enable  */
/**
  * @}
  */

/** @defgroup LPUART_Overrun_Disable  LPUART Advanced Feature Overrun Disable
  * @{
  */
#define LPUART_ADVFEATURE_OVERRUN_ENABLE      0x00000000U             /*!< RX overrun enable  */
#define LPUART_ADVFEATURE_OVERRUN_DISABLE     LPUART_CR3_OVRDIS       /*!< RX overrun disable */
/**
  * @}
  */

/** @defgroup LPUART_DMA_Disable_on_Rx_Error   LPUART Advanced Feature DMA Disable On Rx Error
  * @{
  */
#define LPUART_ADVFEATURE_DMA_ENABLEONRXERROR    0x00000000U          /*!< DMA enable on Reception Error  */
#define LPUART_ADVFEATURE_DMA_DISABLEONRXERROR   LPUART_CR3_DDRE      /*!< DMA disable on Reception Error */
/**
  * @}
  */

/** @defgroup LPUART_MSB_First   LPUART Advanced Feature MSB First
  * @{
  */
#define LPUART_ADVFEATURE_MSBFIRST_DISABLE    0x00000000U             /*!< Most significant bit sent/received
                                                                           first disable                      */
#define LPUART_ADVFEATURE_MSBFIRST_ENABLE     LPUART_CR2_MSBFIRST     /*!< Most significant bit sent/received
                                                                           first enable                       */
/**
  * @}
  */

/** @defgroup LPUART_TXOE_ALWAYS_ON   LPUART Advanced Feature TXOE always on
  * @{
  */
#define LPUART_ADVFEATURE_TXOEALWAYSON_DISABLE    0x00000000U               /*!< LPUART output control by hardware */
#define LPUART_ADVFEATURE_TXOEALWAYSON_ENABLE     LPUART_CR2_TXOE_ALWAYS_ON /*!< LPUART output control by software */
/**
  * @}
  */

/** @defgroup LPUART_Stop_Mode_Enable   LPUART Advanced Feature Stop Mode Enable
  * @{
  */
#define LPUART_ADVFEATURE_STOPMODE_DISABLE    0x00000000U             /*!< LPUART stop mode disable */
#define LPUART_ADVFEATURE_STOPMODE_ENABLE     LPUART_CR1_UESM         /*!< LPUART stop mode enable  */
/**
  * @}
  */

/** @defgroup LPUART_Mute_Mode   LPUART Advanced Feature Mute Mode Enable
  * @{
  */
#define LPUART_ADVFEATURE_MUTEMODE_DISABLE    0x00000000U             /*!< LPUART mute mode disable */
#define LPUART_ADVFEATURE_MUTEMODE_ENABLE     LPUART_CR1_MME          /*!< LPUART mute mode enable  */
/**
  * @}
  */

/** @defgroup LPUART_CR2_ADDRESS_LSB_POS    LPUART Address-matching LSB Position In CR2 Register
  * @{
  */
#define LPUART_CR2_ADDRESS_LSB_POS             24U             /*!< LPUART address-matching LSB position in CR2 register */
/**
  * @}
  */

/** @defgroup LPUART_WakeUp_from_Stop_Selection   LPUART WakeUp From Stop Selection
  * @{
  */
#define LPUART_WAKEUP_ON_ADDRESS              0x00000000U             /*!< LPUART wake-up on address                     */
#define LPUART_WAKEUP_ON_STARTBIT             LPUART_CR3_WUS_1        /*!< LPUART wake-up on start bit                   */
#define LPUART_WAKEUP_ON_READDATA_NONEMPTY    LPUART_CR3_WUS          /*!< LPUART wake-up on receive data register
                                                                           not empty or RXFIFO is not empty            */
/**
  * @}
  */

