tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_lpuart.h
/** @brief  Enable the specified LPUART interrupt.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @param  __INTERRUPT__ specifies the LPUART interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg @ref LPUART_IT_WUF   Wakeup from stop mode interrupt
  *            @arg @ref LPUART_IT_CM    Character match interrupt
  *            @arg @ref LPUART_IT_CTS   CTS change interrupt
  *            @arg @ref LPUART_IT_TXE   Transmit Data Register empty interrupt
  *            @arg @ref LPUART_IT_TC    Transmission complete interrupt
  *            @arg @ref LPUART_IT_RXNE  Receive Data register not empty interrupt
  *            @arg @ref LPUART_IT_IDLE  Idle line detection interrupt
  *            @arg @ref LPUART_IT_PE    Parity Error interrupt
  *            @arg @ref LPUART_IT_ERR   Error interrupt (frame error, noise error, overrun error)
  * @retval None
  */
#define __HAL_LPUART_ENABLE_IT(__HANDLE__, __INTERRUPT__) ( \
                                                           ((((uint8_t)(__INTERRUPT__)) >> 5U) == LPUART_CR1_REG_INDEX)?\
                                                           ((__HANDLE__)->Instance->CR1 |= (1U << ((__INTERRUPT__) & LPUART_IT_MASK))): \
                                                           ((((uint8_t)(__INTERRUPT__)) >> 5U) == LPUART_CR2_REG_INDEX)?\
                                                           ((__HANDLE__)->Instance->CR2 |= (1U << ((__INTERRUPT__) & LPUART_IT_MASK))): \
                                                           ((__HANDLE__)->Instance->CR3 |= (1U << ((__INTERRUPT__) & LPUART_IT_MASK))))

/** @brief  Disable the specified LPUART interrupt.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @param  __INTERRUPT__ specifies the LPUART interrupt source to disable.
  *          This parameter can be one of the following values:
  *            @arg @ref LPUART_IT_WUF   Wakeup from stop mode interrupt
  *            @arg @ref LPUART_IT_CM    Character match interrupt
  *            @arg @ref LPUART_IT_CTS   CTS change interrupt
  *            @arg @ref LPUART_IT_TXE   Transmit Data Register empty interrupt
  *            @arg @ref LPUART_IT_TC    Transmission complete interrupt
  *            @arg @ref LPUART_IT_RXNE  Receive Data register not empty interrupt
  *            @arg @ref LPUART_IT_IDLE  Idle line detection interrupt
  *            @arg @ref LPUART_IT_PE    Parity Error interrupt
  *            @arg @ref LPUART_IT_ERR   Error interrupt (Frame error, noise error, overrun error)
  * @retval None
  */
#define __HAL_LPUART_DISABLE_IT(__HANDLE__, __INTERRUPT__) ( \
                                                            ((((uint8_t)(__INTERRUPT__)) >> 5U) == LPUART_CR1_REG_INDEX)?\
                                                            ((__HANDLE__)->Instance->CR1 &= ~ (1U << ((__INTERRUPT__) & LPUART_IT_MASK))): \
                                                            ((((uint8_t)(__INTERRUPT__)) >> 5U) == LPUART_CR2_REG_INDEX)?\
                                                            ((__HANDLE__)->Instance->CR2 &= ~ (1U << ((__INTERRUPT__) & LPUART_IT_MASK))): \
                                                            ((__HANDLE__)->Instance->CR3 &= ~ (1U << ((__INTERRUPT__) & LPUART_IT_MASK))))

/** @brief  Check whether the specified LPUART interrupt has occurred or not.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @param  __INTERRUPT__ specifies the LPUART interrupt to check.
  *          This parameter can be one of the following values:
  *            @arg @ref LPUART_IT_WUF   Wakeup from stop mode interrupt
  *            @arg @ref LPUART_IT_CM    Character match interrupt
  *            @arg @ref LPUART_IT_CTS   CTS change interrupt
  *            @arg @ref LPUART_IT_TXE   Transmit Data Register empty interrupt
  *            @arg @ref LPUART_IT_TC    Transmission complete interrupt
  *            @arg @ref LPUART_IT_RXNE  Receive Data register not empty interrupt
  *            @arg @ref LPUART_IT_IDLE  Idle line detection interrupt
  *            @arg @ref LPUART_IT_PE    Parity Error interrupt
  *            @arg @ref LPUART_IT_ERR   Error interrupt (Frame error, noise error, overrun error)
  * @retval The new state of __INTERRUPT__ (SET or RESET).
  */
#define __HAL_LPUART_GET_IT(__HANDLE__, __INTERRUPT__) ((((__HANDLE__)->Instance->ISR & ((__INTERRUPT__) & LPUART_SR_MASK)) != 0U) ? SET : RESET)

/** @brief  Check whether the specified LPUART interrupt source is enabled or not.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @param  __INTERRUPT__ specifies the LPUART interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg @ref LPUART_IT_WUF   Wakeup from stop mode interrupt
  *            @arg @ref LPUART_IT_CM    Character match interrupt
  *            @arg @ref LPUART_IT_CTS   CTS change interrupt
  *            @arg @ref LPUART_IT_TXE   Transmit Data Register empty interrupt
  *            @arg @ref LPUART_IT_TC    Transmission complete interrupt
  *            @arg @ref LPUART_IT_RXNE  Receive Data register not empty interrupt
  *            @arg @ref LPUART_IT_IDLE  Idle line detection interrupt
  *            @arg @ref LPUART_IT_PE    Parity Error interrupt
  *            @arg @ref LPUART_IT_ERR   Error interrupt (Frame error, noise error, overrun error)
  * @retval The new state of __INTERRUPT__ (SET or RESET).
  */
#define __HAL_LPUART_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ( \
                                                               (((((((uint8_t)(__INTERRUPT__)) >> 5U) == LPUART_CR1_REG_INDEX) ? (__HANDLE__)->Instance->CR1 : \
                                                                 (((((uint8_t)(__INTERRUPT__)) >> 5U) == LPUART_CR2_REG_INDEX) ? (__HANDLE__)->Instance->CR2 : \
                                                                   (__HANDLE__)->Instance->CR3)) & (1U << (((uint16_t)(__INTERRUPT__)) & LPUART_IT_MASK))) != RESET) ? SET : RESET)

