tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_lpuart.h
/* Private macros --------------------------------------------------------*/
/** @defgroup LPUART_Private_Macros   LPUART Private Macros
  * @{
  */
/** @brief  Get LPUART clok division factor from clock prescaler value.
  * @param  __CLOCKPRESCALER__ LPUART prescaler value.
  * @retval LPUART clock division factor
  */
#define LPUART_GET_DIV_FACTOR(__CLOCKPRESCALER__) \
  (((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV1)   ? 1U :       \
   ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV2)   ? 2U :       \
   ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV4)   ? 4U :       \
   ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV6)   ? 6U :       \
   ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV8)   ? 8U :       \
   ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV10)  ? 10U :      \
   ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV12)  ? 12U :      \
   ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV16)  ? 16U :      \
   ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV32)  ? 32U :      \
   ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV64)  ? 64U :      \
   ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV128) ? 128U :     \
   ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV256) ? 256U : 1U)


/** @brief  BRR division operation to set BRR register with LPUART.
  * @param  __PCLK__ LPUART clock.
  * @param  __BAUD__ Baud rate set by the user.
  * @param  __CLOCKPRESCALER__ LPUART prescaler value.
  * @retval Division result
  */
#define LPUART_DIV_LPUART(__PCLK__, __BAUD__, __CLOCKPRESCALER__)                        \
  ((uint32_t)((((((uint64_t)(__PCLK__))/(LPUARTPrescTable[(__CLOCKPRESCALER__)]))*256U)+ \
               (uint32_t)((__BAUD__)/2U)) / (__BAUD__))                                \
  )

/** @brief  BRR division operation to set BRR register in 8-bit oversampling mode.
  * @param  __PCLK__ LPUART clock.
  * @param  __BAUD__ Baud rate set by the user.
  * @param  __CLOCKPRESCALER__ LPUART prescaler value.
  * @retval Division result
  */
#define LPUART_DIV_SAMPLING8(__PCLK__, __BAUD__, __CLOCKPRESCALER__)                        \
  (((((__PCLK__)/LPUARTPrescTable[(__CLOCKPRESCALER__)])*2U) + ((__BAUD__)/2U)) / (__BAUD__))

/** @brief  BRR division operation to set BRR register in 16-bit oversampling mode.
  * @param  __PCLK__ LPUART clock.
  * @param  __BAUD__ Baud rate set by the user.
  * @param  __CLOCKPRESCALER__ LPUART prescaler value.
  * @retval Division result
  */
#define LPUART_DIV_SAMPLING16(__PCLK__, __BAUD__, __CLOCKPRESCALER__)                       \
  ((((__PCLK__)/LPUARTPrescTable[(__CLOCKPRESCALER__)]) + ((__BAUD__)/2U)) / (__BAUD__))

/** @brief  Check whether or not LPUART instance is Low Power LPUART.
  * @param  __HANDLE__ specifies the LPUART Handle.
  * @retval SET (instance is LPUART) or RESET (instance isn't LPUART)
  */
#define LPUART_INSTANCE_LOWPOWER(__HANDLE__) (IS_LPUART_INSTANCE((__HANDLE__)->Instance))

/** @brief  Check LPUART Baud rate.
  * @param  __BAUDRATE__ Baudrate specified by the user.
  *         The maximum Baud Rate is derived from the maximum clock on T0
  *         divided by the smallest oversampling used on the LPUART
  * @retval SET (__BAUDRATE__ is valid) or RESET (__BAUDRATE__ is invalid)
  */
#define IS_LPUART_BAUDRATE(__BAUDRATE__) ((__BAUDRATE__) < 18750001U)

/** @brief  Check LPUART assertion time.
  * @param  __TIME__ 5-bit value assertion time.
  * @retval Test result (TRUE or FALSE).
  */
#define IS_LPUART_ASSERTIONTIME(__TIME__)    ((__TIME__) <= 0x1FU)

/** @brief  Check LPUART deassertion time.
  * @param  __TIME__ 5-bit value deassertion time.
  * @retval Test result (TRUE or FALSE).
  */
#define IS_LPUART_DEASSERTIONTIME(__TIME__) ((__TIME__) <= 0x1FU)

/**
  * @brief Ensure that LPUART frame number of stop bits is valid.
  * @param __STOPBITS__ LPUART frame number of stop bits.
  * @retval SET (__STOPBITS__ is valid) or RESET (__STOPBITS__ is invalid)
  */
#define IS_LPUART_STOPBITS(__STOPBITS__) (((__STOPBITS__) == LPUART_STOPBITS_1) || \
                                          ((__STOPBITS__) == LPUART_STOPBITS_2))

/**
  * @brief Ensure that LPUART frame parity is valid.
  * @param __PARITY__ LPUART frame parity.
  * @retval SET (__PARITY__ is valid) or RESET (__PARITY__ is invalid)
  */
#define IS_LPUART_PARITY(__PARITY__) (((__PARITY__) == LPUART_PARITY_NONE) || \
                                      ((__PARITY__) == LPUART_PARITY_EVEN) || \
                                      ((__PARITY__) == LPUART_PARITY_ODD))

/**
  * @brief Ensure that LPUART hardware flow control is valid.
  * @param __CONTROL__ LPUART hardware flow control.
  * @retval SET (__CONTROL__ is valid) or RESET (__CONTROL__ is invalid)
  */
#define IS_LPUART_HARDWARE_FLOW_CONTROL(__CONTROL__)\
  (((__CONTROL__) == LPUART_HWCONTROL_NONE) || \
   ((__CONTROL__) == LPUART_HWCONTROL_RTS)  || \
   ((__CONTROL__) == LPUART_HWCONTROL_CTS)  || \
   ((__CONTROL__) == LPUART_HWCONTROL_RTS_CTS))

/**
  * @brief Ensure that LPUART communication mode is valid.
  * @param __MODE__ LPUART communication mode.
  * @retval SET (__MODE__ is valid) or RESET (__MODE__ is invalid)
  */
#define IS_LPUART_MODE(__MODE__) ((((__MODE__) & (~((uint32_t)(LPUART_MODE_TX_RX)))) == 0x00U) && ((__MODE__) != 0x00U))

/**
  * @brief Ensure that LPUART state is valid.
  * @param __STATE__ LPUART state.
  * @retval SET (__STATE__ is valid) or RESET (__STATE__ is invalid)
  */
#define IS_LPUART_STATE(__STATE__) (((__STATE__) == LPUART_STATE_DISABLE) || \
                                    ((__STATE__) == LPUART_STATE_ENABLE))

/**
  * @brief Ensure that LPUART DMA TX state is valid.
  * @param __DMATX__ LPUART DMA TX state.
  * @retval SET (__DMATX__ is valid) or RESET (__DMATX__ is invalid)
  */
#define IS_LPUART_DMA_TX(__DMATX__)     (((__DMATX__) == LPUART_DMA_TX_DISABLE) || \
                                         ((__DMATX__) == LPUART_DMA_TX_ENABLE))

/**
  * @brief Ensure that LPUART DMA RX state is valid.
  * @param __DMARX__ LPUART DMA RX state.
  * @retval SET (__DMARX__ is valid) or RESET (__DMARX__ is invalid)
  */
#define IS_LPUART_DMA_RX(__DMARX__)     (((__DMARX__) == LPUART_DMA_RX_DISABLE) || \
                                         ((__DMARX__) == LPUART_DMA_RX_ENABLE))

/**
  * @brief Ensure that LPUART half-duplex state is valid.
  * @param __HDSEL__ LPUART half-duplex state.
  * @retval SET (__HDSEL__ is valid) or RESET (__HDSEL__ is invalid)
  */
#define IS_LPUART_HALF_DUPLEX(__HDSEL__)     (((__HDSEL__) == LPUART_HALF_DUPLEX_DISABLE) || \
                                              ((__HDSEL__) == LPUART_HALF_DUPLEX_ENABLE))

/**
  * @brief Ensure that LPUART wake-up method is valid.
  * @param __WAKEUP__ LPUART wake-up method .
  * @retval SET (__WAKEUP__ is valid) or RESET (__WAKEUP__ is invalid)
  */
#define IS_LPUART_WAKEUPMETHOD(__WAKEUP__) (((__WAKEUP__) == LPUART_WAKEUPMETHOD_IDLELINE) || \
                                            ((__WAKEUP__) == LPUART_WAKEUPMETHOD_ADDRESSMARK))

/**
  * @brief Ensure that LPUART request parameter is valid.
  * @param __PARAM__ LPUART request parameter.
  * @retval SET (__PARAM__ is valid) or RESET (__PARAM__ is invalid)
  */
#define IS_LPUART_REQUEST_PARAMETER(__PARAM__) (((__PARAM__) == LPUART_SENDBREAK_REQUEST)    || \
                                                ((__PARAM__) == LPUART_MUTE_MODE_REQUEST))

/**
  * @brief Ensure that LPUART advanced features initialization is valid.
  * @param __INIT__ LPUART advanced features initialization.
  * @retval SET (__INIT__ is valid) or RESET (__INIT__ is invalid)
  */
#define IS_LPUART_ADVFEATURE_INIT(__INIT__) ((__INIT__) <= (LPUART_ADVFEATURE_NO_INIT                | \
                                                            LPUART_ADVFEATURE_TXINVERT_INIT          | \
                                                            LPUART_ADVFEATURE_RXINVERT_INIT          | \
                                                            LPUART_ADVFEATURE_DATAINVERT_INIT        | \
                                                            LPUART_ADVFEATURE_SWAP_INIT              | \
                                                            LPUART_ADVFEATURE_RXOVERRUNDISABLE_INIT  | \
                                                            LPUART_ADVFEATURE_DMADISABLEONERROR_INIT | \
                                                            LPUART_ADVFEATURE_MSBFIRST_INIT))

/**
  * @brief Ensure that LPUART frame TX inversion setting is valid.
  * @param __TXINV__ LPUART frame TX inversion setting.
  * @retval SET (__TXINV__ is valid) or RESET (__TXINV__ is invalid)
  */
#define IS_LPUART_ADVFEATURE_TXINV(__TXINV__) (((__TXINV__) == LPUART_ADVFEATURE_TXINV_DISABLE) || \
                                               ((__TXINV__) == LPUART_ADVFEATURE_TXINV_ENABLE))

/**
  * @brief Ensure that LPUART frame RX inversion setting is valid.
  * @param __RXINV__ LPUART frame RX inversion setting.
  * @retval SET (__RXINV__ is valid) or RESET (__RXINV__ is invalid)
  */
#define IS_LPUART_ADVFEATURE_RXINV(__RXINV__) (((__RXINV__) == LPUART_ADVFEATURE_RXINV_DISABLE) || \
                                               ((__RXINV__) == LPUART_ADVFEATURE_RXINV_ENABLE))

/**
  * @brief Ensure that LPUART frame data inversion setting is valid.
  * @param __DATAINV__ LPUART frame data inversion setting.
  * @retval SET (__DATAINV__ is valid) or RESET (__DATAINV__ is invalid)
  */
#define IS_LPUART_ADVFEATURE_DATAINV(__DATAINV__) (((__DATAINV__) == LPUART_ADVFEATURE_DATAINV_DISABLE) || \
                                                   ((__DATAINV__) == LPUART_ADVFEATURE_DATAINV_ENABLE))

/**
  * @brief Ensure that LPUART frame RX/TX pins swap setting is valid.
  * @param __SWAP__ LPUART frame RX/TX pins swap setting.
  * @retval SET (__SWAP__ is valid) or RESET (__SWAP__ is invalid)
  */
#define IS_LPUART_ADVFEATURE_SWAP(__SWAP__) (((__SWAP__) == LPUART_ADVFEATURE_SWAP_DISABLE) || \
                                             ((__SWAP__) == LPUART_ADVFEATURE_SWAP_ENABLE))

/**
  * @brief Ensure that LPUART frame overrun setting is valid.
  * @param __OVERRUN__ LPUART frame overrun setting.
  * @retval SET (__OVERRUN__ is valid) or RESET (__OVERRUN__ is invalid)
  */
#define IS_LPUART_OVERRUN(__OVERRUN__)     (((__OVERRUN__) == LPUART_ADVFEATURE_OVERRUN_ENABLE) || \
                                            ((__OVERRUN__) == LPUART_ADVFEATURE_OVERRUN_DISABLE))

/**
  * @brief Ensure that LPUART DMA enabling or disabling on error setting is valid.
  * @param __DMA__ LPUART DMA enabling or disabling on error setting.
  * @retval SET (__DMA__ is valid) or RESET (__DMA__ is invalid)
  */
#define IS_LPUART_ADVFEATURE_DMAONRXERROR(__DMA__)  (((__DMA__) == LPUART_ADVFEATURE_DMA_ENABLEONRXERROR) || \
                                                     ((__DMA__) == LPUART_ADVFEATURE_DMA_DISABLEONRXERROR))

/**
  * @brief Ensure that LPUART frame MSB first setting is valid.
  * @param __MSBFIRST__ LPUART frame MSB first setting.
  * @retval SET (__MSBFIRST__ is valid) or RESET (__MSBFIRST__ is invalid)
  */
#define IS_LPUART_ADVFEATURE_MSBFIRST(__MSBFIRST__) (((__MSBFIRST__) == LPUART_ADVFEATURE_MSBFIRST_DISABLE) || \
                                                     ((__MSBFIRST__) == LPUART_ADVFEATURE_MSBFIRST_ENABLE))

/**
  * @brief Ensure that LPUART stop mode state is valid.
  * @param __STOPMODE__ LPUART stop mode state.
  * @retval SET (__STOPMODE__ is valid) or RESET (__STOPMODE__ is invalid)
  */
#define IS_LPUART_ADVFEATURE_STOPMODE(__STOPMODE__) (((__STOPMODE__) == LPUART_ADVFEATURE_STOPMODE_DISABLE) || \
                                                     ((__STOPMODE__) == LPUART_ADVFEATURE_STOPMODE_ENABLE))

/**
  * @brief Ensure that LPUART mute mode state is valid.
  * @param __MUTE__ LPUART mute mode state.
  * @retval SET (__MUTE__ is valid) or RESET (__MUTE__ is invalid)
  */
#define IS_LPUART_MUTE_MODE(__MUTE__)       (((__MUTE__) == LPUART_ADVFEATURE_MUTEMODE_DISABLE) || \
                                             ((__MUTE__) == LPUART_ADVFEATURE_MUTEMODE_ENABLE))

/**
  * @brief Ensure that LPUART wake-up selection is valid.
  * @param __WAKE__ LPUART wake-up selection.
  * @retval SET (__WAKE__ is valid) or RESET (__WAKE__ is invalid)
  */
#define IS_LPUART_WAKEUP_SELECTION(__WAKE__) (((__WAKE__) == LPUART_WAKEUP_ON_ADDRESS)           || \
                                              ((__WAKE__) == LPUART_WAKEUP_ON_STARTBIT)          || \
                                              ((__WAKE__) == LPUART_WAKEUP_ON_READDATA_NONEMPTY))

/**
  * @brief Ensure that LPUART driver enable polarity is valid.
  * @param __POLARITY__ LPUART driver enable polarity.
  * @retval SET (__POLARITY__ is valid) or RESET (__POLARITY__ is invalid)
  */
#define IS_LPUART_DE_POLARITY(__POLARITY__)    (((__POLARITY__) == LPUART_DE_POLARITY_HIGH) || \
                                                ((__POLARITY__) == LPUART_DE_POLARITY_LOW))

/**
  * @brief Ensure that LPUART Prescaler is valid.
  * @param __CLOCKPRESCALER__ LPUART Prescaler value.
  * @retval SET (__CLOCKPRESCALER__ is valid) or RESET (__CLOCKPRESCALER__ is invalid)
  */
#define IS_LPUART_PRESCALER(__CLOCKPRESCALER__) (((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV1)   || \
                                                 ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV2)   || \
                                                 ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV4)   || \
                                                 ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV6)   || \
                                                 ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV8)   || \
                                                 ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV10)  || \
                                                 ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV12)  || \
                                                 ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV16)  || \
                                                 ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV32)  || \
                                                 ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV64)  || \
                                                 ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV128) || \
                                                 ((__CLOCKPRESCALER__) == LPUART_PRESCALER_DIV256))

/**
  * @}
  */

/* Include LPUART HAL Extended module */
#include "py32f032_hal_lpuart_ex.h"


